Environment: prod. Pipeline Stage: prod
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cloud-agent.azurerm_lb_probe.health_probe["lbxwcca01"] must be replaced
-/+ resource "azurerm_lb_probe" "health_probe" {
      ~ id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/probes/rule-3389-lbxwcca01" -> (known after apply)
      ~ load_balancer_rules = [
          - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/loadBalancingRules/rule-3389-lbxwcca01",
        ] -> (known after apply)
      ~ name                = "rule-3389-lbxwcca01" -> "rule-433-lbxwcca01" # forces replacement
      ~ port                = 3389 -> 433
      ~ protocol            = "Tcp" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_probe.health_probe["lbxwcca02"] must be replaced
-/+ resource "azurerm_lb_probe" "health_probe" {
      ~ id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca02/probes/rule-3389-lbxwcca02" -> (known after apply)
      ~ load_balancer_rules = [
          - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca02/loadBalancingRules/rule-3389-lbxwcca02",
        ] -> (known after apply)
      ~ name                = "rule-3389-lbxwcca02" -> "rule-433-lbxwcca02" # forces replacement
      ~ port                = 3389 -> 433
      ~ protocol            = "Tcp" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_probe.health_probe["lbxwcca03"] must be replaced
-/+ resource "azurerm_lb_probe" "health_probe" {
      ~ id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca03/probes/rule-3389-lbxwcca03" -> (known after apply)
      ~ load_balancer_rules = [
          - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca03/loadBalancingRules/rule-3389-lbxwcca03",
        ] -> (known after apply)
      ~ name                = "rule-3389-lbxwcca03" -> "rule-433-lbxwcca03" # forces replacement
      ~ port                = 3389 -> 433
      ~ protocol            = "Tcp" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_probe.health_probe["lbxwcca04"] must be replaced
-/+ resource "azurerm_lb_probe" "health_probe" {
      ~ id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca04/probes/rule-3389-lbxwcca04" -> (known after apply)
      ~ load_balancer_rules = [
          - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca04/loadBalancingRules/rule-3389-lbxwcca04",
        ] -> (known after apply)
      ~ name                = "rule-3389-lbxwcca04" -> "rule-433-lbxwcca04" # forces replacement
      ~ port                = 3389 -> 433
      ~ protocol            = "Tcp" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_probe.health_probe["lbxwcca05"] must be replaced
-/+ resource "azurerm_lb_probe" "health_probe" {
      ~ id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca05/probes/rule-3389-lbxwcca05" -> (known after apply)
      ~ load_balancer_rules = [
          - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca05/loadBalancingRules/rule-3389-lbxwcca05",
        ] -> (known after apply)
      ~ name                = "rule-3389-lbxwcca05" -> "rule-433-lbxwcca05" # forces replacement
      ~ port                = 3389 -> 433
      ~ protocol            = "Tcp" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_probe.health_probe["lbxwcca06"] must be replaced
-/+ resource "azurerm_lb_probe" "health_probe" {
      ~ id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca06/probes/rule-3389-lbxwcca06" -> (known after apply)
      ~ load_balancer_rules = [
          - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca06/loadBalancingRules/rule-3389-lbxwcca06",
        ] -> (known after apply)
      ~ name                = "rule-3389-lbxwcca06" -> "rule-433-lbxwcca06" # forces replacement
      ~ port                = 3389 -> 433
      ~ protocol            = "Tcp" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_probe.health_probe["lbxwctestca01"] must be replaced
-/+ resource "azurerm_lb_probe" "health_probe" {
      ~ id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/probes/rule-3389-lbxwctestca01" -> (known after apply)
      ~ load_balancer_rules = [
          - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/loadBalancingRules/rule-3389-lbxwctestca01",
        ] -> (known after apply)
      ~ name                = "rule-3389-lbxwctestca01" -> "rule-433-lbxwctestca01" # forces replacement
      ~ port                = 3389 -> 433
      ~ protocol            = "Tcp" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_rule.loadbalancing_rule["lbxwcca01"] must be replaced
-/+ resource "azurerm_lb_rule" "loadbalancing_rule" {
      ~ backend_address_pool_id        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/backendAddressPools/be-lbxwcca01" -> (known after apply)
      ~ backend_port                   = 3389 -> 433
      - enable_tcp_reset               = false -> null
      ~ frontend_ip_configuration_id   = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/frontendIPConfigurations/fe-lbxwcca01" -> (known after apply)
      ~ frontend_port                  = 3389 -> 433
      ~ id                             = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/loadBalancingRules/rule-3389-lbxwcca01" -> (known after apply)
      ~ idle_timeout_in_minutes        = 4 -> (known after apply)
      ~ load_distribution              = "SourceIPProtocol" -> "SourceIP"
      ~ name                           = "rule-3389-lbxwcca01" -> "rule-433-lbxwcca01" # forces replacement
      ~ probe_id                       = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/probes/rule-3389-lbxwcca01" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_rule.loadbalancing_rule["lbxwcca02"] must be replaced
-/+ resource "azurerm_lb_rule" "loadbalancing_rule" {
      ~ backend_address_pool_id        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca02/backendAddressPools/be-lbxwcca02" -> (known after apply)
      ~ backend_port                   = 3389 -> 433
      - enable_tcp_reset               = false -> null
      ~ frontend_ip_configuration_id   = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca02/frontendIPConfigurations/fe-lbxwcca02" -> (known after apply)
      ~ frontend_port                  = 3389 -> 433
      ~ id                             = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca02/loadBalancingRules/rule-3389-lbxwcca02" -> (known after apply)
      ~ idle_timeout_in_minutes        = 4 -> (known after apply)
      ~ load_distribution              = "SourceIPProtocol" -> "SourceIP"
      ~ name                           = "rule-3389-lbxwcca02" -> "rule-433-lbxwcca02" # forces replacement
      ~ probe_id                       = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca02/probes/rule-3389-lbxwcca02" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_rule.loadbalancing_rule["lbxwcca03"] must be replaced
-/+ resource "azurerm_lb_rule" "loadbalancing_rule" {
      ~ backend_address_pool_id        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca03/backendAddressPools/be-lbxwcca03" -> (known after apply)
      ~ backend_port                   = 3389 -> 433
      - enable_tcp_reset               = false -> null
      ~ frontend_ip_configuration_id   = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca03/frontendIPConfigurations/fe-lbxwcca03" -> (known after apply)
      ~ frontend_port                  = 3389 -> 433
      ~ id                             = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca03/loadBalancingRules/rule-3389-lbxwcca03" -> (known after apply)
      ~ idle_timeout_in_minutes        = 4 -> (known after apply)
      ~ load_distribution              = "SourceIPProtocol" -> "SourceIP"
      ~ name                           = "rule-3389-lbxwcca03" -> "rule-433-lbxwcca03" # forces replacement
      ~ probe_id                       = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca03/probes/rule-3389-lbxwcca03" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_rule.loadbalancing_rule["lbxwcca04"] must be replaced
-/+ resource "azurerm_lb_rule" "loadbalancing_rule" {
      ~ backend_address_pool_id        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca04/backendAddressPools/be-lbxwcca04" -> (known after apply)
      ~ backend_port                   = 3389 -> 433
      - enable_tcp_reset               = false -> null
      ~ frontend_ip_configuration_id   = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca04/frontendIPConfigurations/fe-lbxwcca04" -> (known after apply)
      ~ frontend_port                  = 3389 -> 433
      ~ id                             = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca04/loadBalancingRules/rule-3389-lbxwcca04" -> (known after apply)
      ~ idle_timeout_in_minutes        = 4 -> (known after apply)
      ~ load_distribution              = "SourceIPProtocol" -> "SourceIP"
      ~ name                           = "rule-3389-lbxwcca04" -> "rule-433-lbxwcca04" # forces replacement
      ~ probe_id                       = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca04/probes/rule-3389-lbxwcca04" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_rule.loadbalancing_rule["lbxwcca05"] must be replaced
-/+ resource "azurerm_lb_rule" "loadbalancing_rule" {
      ~ backend_address_pool_id        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca05/backendAddressPools/be-lbxwcca05" -> (known after apply)
      ~ backend_port                   = 3389 -> 433
      - enable_tcp_reset               = false -> null
      ~ frontend_ip_configuration_id   = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca05/frontendIPConfigurations/fe-lbxwcca05" -> (known after apply)
      ~ frontend_port                  = 3389 -> 433
      ~ id                             = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca05/loadBalancingRules/rule-3389-lbxwcca05" -> (known after apply)
      ~ idle_timeout_in_minutes        = 4 -> (known after apply)
      ~ load_distribution              = "SourceIPProtocol" -> "SourceIP"
      ~ name                           = "rule-3389-lbxwcca05" -> "rule-433-lbxwcca05" # forces replacement
      ~ probe_id                       = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca05/probes/rule-3389-lbxwcca05" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_rule.loadbalancing_rule["lbxwcca06"] must be replaced
-/+ resource "azurerm_lb_rule" "loadbalancing_rule" {
      ~ backend_address_pool_id        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca06/backendAddressPools/be-lbxwcca06" -> (known after apply)
      ~ backend_port                   = 3389 -> 433
      - enable_tcp_reset               = false -> null
      ~ frontend_ip_configuration_id   = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca06/frontendIPConfigurations/fe-lbxwcca06" -> (known after apply)
      ~ frontend_port                  = 3389 -> 433
      ~ id                             = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca06/loadBalancingRules/rule-3389-lbxwcca06" -> (known after apply)
      ~ idle_timeout_in_minutes        = 4 -> (known after apply)
      ~ load_distribution              = "SourceIPProtocol" -> "SourceIP"
      ~ name                           = "rule-3389-lbxwcca06" -> "rule-433-lbxwcca06" # forces replacement
      ~ probe_id                       = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca06/probes/rule-3389-lbxwcca06" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_rule.loadbalancing_rule["lbxwctestca01"] must be replaced
-/+ resource "azurerm_lb_rule" "loadbalancing_rule" {
      ~ backend_address_pool_id        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/backendAddressPools/be-lbxwctestca01" -> (known after apply)
      ~ backend_port                   = 3389 -> 433
      - enable_tcp_reset               = false -> null
      ~ frontend_ip_configuration_id   = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/frontendIPConfigurations/fe-lbxwctestca01" -> (known after apply)
      ~ frontend_port                  = 3389 -> 433
      ~ id                             = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/loadBalancingRules/rule-3389-lbxwctestca01" -> (known after apply)
      ~ idle_timeout_in_minutes        = 4 -> (known after apply)
      ~ load_distribution              = "SourceIPProtocol" -> "SourceIP"
      ~ name                           = "rule-3389-lbxwctestca01" -> "rule-433-lbxwctestca01" # forces replacement
      ~ probe_id                       = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/probes/rule-3389-lbxwctestca01" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.device-manager.azurerm_network_interface.NIC["vmxwctestdm01"] will be updated in-place
  ~ resource "azurerm_network_interface" "NIC" {
        id                            = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/networkInterfaces/nic1-vmxwctestdm01"
        name                          = "nic1-vmxwctestdm01"
        tags                          = {
            "ApplicationName"  = "VelocityLandingZone"
            "BusinessUnit"     = "MOJ"
            "CostCentre"       = "MOJ"
            "OwnerName"        = "rob.ashworth@justice.gov.uk"
            "ProjectStartDate" = "05102020"
            "RequesterName"    = "rob.ashworth@justice.gov.uk"
            "ServiceLevel"     = "Gold"
        }
        # (11 unchanged attributes hidden)

      ~ ip_configuration {
            name                          = "ipconfig1"
          - public_ip_address_id          = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/publicIPAddresses/pip-xwc" -> null
            # (5 unchanged attributes hidden)
        }
    }

Plan: 14 to add, 1 to change, 14 to destroy.